Revit 2027 API
DividedPath.IsClosedLoop Property
 Whether or not the path forms a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsClosedLoop { get; }
Public ReadOnly Property IsClosedLoop As Boolean
	Get
public:
property bool IsClosedLoop {
	bool get ();
}
member IsClosedLoop : bool with get
Property Value
Boolean
Remarks
 True if the path form a closed loop. False otherwise.
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace